define calendar = {1: ['Четверг', 1, 'Сентябрь', 'будний', False], 2: ['Пятница', 2, 'Сентябрь', 'будний', False], 3: ['Суббота', 3, 'Сентябрь', 'выходной', False],
            4: ['Воскресенье', 4, 'Сентябрь', 'выходной', False], 5: ['Понедельник', 5, 'Сентябрь', 'будний', False], 6: ['Вторник', 6, 'Сентябрь', 'будний', False],
            7: ['Среда', 7, 'Сентябрь', 'будний', False], 8: ['Четверг', 8, 'Сентябрь', 'будний', False], 9: ['Пятница', 9, 'Сентябрь', 'будний', False],
            10: ['Суббота', 10, 'Сентябрь', 'выходной', False], 11: ['Воскресенье', 11, 'Сентябрь', 'выходной', False], 12: ['Понедельник', 12, 'Сентябрь', 'будний', True],
            13: ['Вторник', 13, 'Сентябрь', 'будний', False], 14: ['Среда', 14, 'Сентябрь', 'будний', False], 15: ['Четверг', 15, 'Сентябрь', 'будний', False],
            16: ['Пятница', 16, 'Сентябрь', 'будний', False], 17: ['Суббота', 17, 'Сентябрь', 'выходной', False], 18: ['Воскресенье', 18, 'Сентябрь', 'выходной', False],
            19: ['Понедельник', 19, 'Сентябрь', 'будний', False], 20: ['Вторник', 20, 'Сентябрь', 'будний', False], 21: ['Среда', 21, 'Сентябрь', 'будний', False],
            22: ['Четверг', 22, 'Сентябрь', 'будний', False], 23: ['Пятница', 23, 'Сентябрь', 'будний', False], 24: ['Суббота', 24, 'Сентябрь', 'выходной', False],
            25: ['Воскресенье', 25, 'Сентябрь', 'выходной', False], 26: ['Понедельник', 26, 'Сентябрь', 'будний', True], 27: ['Вторник', 27, 'Сентябрь', 'будний', False],
            28: ['Среда', 28, 'Сентябрь', 'будний', False], 29: ['Четверг', 29, 'Сентябрь', 'будний', False], 30: ['Пятница', 30, 'Сентябрь', 'будний', False],
            31: ['Суббота', 1, 'Октябрь', 'выходной', False], 32: ['Воскресенье', 2, 'Октябрь', 'выходной', False], 33: ['Понедельник', 3, 'Октябрь', 'будний', False],
            34: ['Вторник', 4, 'Октябрь', 'будний', False], 35: ['Среда', 5, 'Октябрь', 'будний', False], 36: ['Четверг', 6, 'Октябрь', 'будний', True],
            37: ['Пятница', 7, 'Октябрь', 'будний', False], 38: ['Суббота', 8, 'Октябрь', 'выходной', False], 39: ['Воскресенье', 9, 'Октябрь', 'выходной', False],
            40: ['Понедельник', 10, 'Октябрь', 'будний', False], 41: ['Вторник', 11, 'Октябрь', 'будний', False], 42: ['Среда', 12, 'Октябрь', 'будний', False],
            43: ['Четверг', 13, 'Октябрь', 'будний', False], 44: ['Пятница', 14, 'Октябрь', 'будний', False], 45: ['Суббота', 15, 'Октябрь', 'выходной', False],
            46: ['Воскресенье', 16, 'Октябрь', 'выходной', False], 47: ['Понедельник', 17, 'Октябрь', 'будний', False], 48: ['Вторник', 18, 'Октябрь', 'будний', True],
            49: ['Среда', 19, 'Октябрь', 'будний', False], 50: ['Четверг', 20, 'Октябрь', 'будний', False], 51: ['Пятница', 21, 'Октябрь', 'будний', False],
            52: ['Суббота', 22, 'Октябрь', 'выходной', False], 53: ['Воскресенье', 23, 'Октябрь', 'выходной', False], 54: ['Понедельник', 24, 'Октябрь', 'будний', False],
            55: ['Вторник', 25, 'Октябрь', 'будний', False], 56: ['Среда', 26, 'Октябрь', 'будний', False], 57: ['Четверг', 27, 'Октябрь', 'будний', False],
            58: ['Пятница', 28, 'Октябрь', 'будний', True], 59: ['Суббота', 29, 'Октябрь', 'выходной', False], 60: ['Воскресенье', 30, 'Октябрь', 'выходной', False],
            61: ['Понедельник', 31, 'Октябрь', 'будний', False], 62: ['Вторник', 1, 'Ноябрь', 'будний', False], 63: ['Среда', 2, 'Ноябрь', 'будний', False],
            64: ['Четверг', 3, 'Ноябрь', 'будний', False], 65: ['Пятница', 4, 'Ноябрь', 'будний', False], 66: ['Суббота', 5, 'Ноябрь', 'выходной', False],
            67: ['Воскресенье', 6, 'Ноябрь', 'выходной', False], 68: ['Понедельник', 7, 'Ноябрь', 'будний', True], 69: ['Вторник', 8, 'Ноябрь', 'будний', False],
            70: ['Среда', 9, 'Ноябрь', 'будний', False], 71: ['Четверг', 10, 'Ноябрь', 'будний', False], 72: ['Пятница', 11, 'Ноябрь', 'будний', False],
            73: ['Суббота', 12, 'Ноябрь', 'выходной', False], 74: ['Воскресенье', 13, 'Ноябрь', 'выходной', False], 75: ['Понедельник', 14, 'Ноябрь', 'будний', False],
            76: ['Вторник', 15, 'Ноябрь', 'будний', False], 77: ['Среда', 16, 'Ноябрь', 'будний', False], 78: ['Четверг', 17, 'Ноябрь', 'будний', True],
            79: ['Пятница', 18, 'Ноябрь', 'будний', False], 80: ['Суббота', 19, 'Ноябрь', 'выходной', False], 81: ['Воскресенье', 20, 'Ноябрь', 'выходной', False],
            82: ['Понедельник', 21, 'Ноябрь', 'будний', False], 83: ['Вторник', 22, 'Ноябрь', 'будний', False], 84: ['Среда', 23, 'Ноябрь', 'будний', False],
            85: ['Четверг', 24, 'Ноябрь', 'будний', False], 86: ['Пятница', 25, 'Ноябрь', 'будний', False], 87: ['Суббота', 26, 'Ноябрь', 'выходной', False],
            88: ['Воскресенье', 27, 'Ноябрь', 'выходной', False], 89: ['Понедельник', 28, 'Ноябрь', 'будний', False], 90: ['Вторник', 29, 'Ноябрь', 'будний', True],
            91: ['Среда', 30, 'Ноябрь', 'будний', False], 92: ['Четверг', 1, 'Декабрь', 'будний', False], 93: ['Пятница', 2, 'Декабрь', 'будний', False],
            94: ['Суббота', 3, 'Декабрь', 'выходной', False], 95: ['Воскресенье', 4, 'Декабрь', 'выходной', False], 96: ['Понедельник', 5, 'Декабрь', 'будний', False],
            97: ['Вторник', 6, 'Декабрь', 'будний', False], 98: ['Среда', 7, 'Декабрь', 'будний', False], 99: ['Четверг', 8, 'Декабрь', 'будний', False],
            100: ['Пятница', 9, 'Декабрь', 'будний', True], 101: ['Суббота', 10, 'Декабрь', 'выходной', False], 102: ['Воскресенье', 11, 'Декабрь', 'выходной', False],
            103: ['Понедельник', 12, 'Декабрь', 'будний', False], 104: ['Вторник', 13, 'Декабрь', 'будний', False], 105: ['Среда', 14, 'Декабрь', 'будний', False],
            106: ['Четверг', 15, 'Декабрь', 'будний', False], 107: ['Пятница', 16, 'Декабрь', 'будний', False], 108: ['Суббота', 17, 'Декабрь', 'выходной', False],
            109: ['Воскресенье', 18, 'Декабрь', 'выходной', False], 110: ['Понедельник', 19, 'Декабрь', 'будний', False], 111: ['Вторник', 20, 'Декабрь', 'будний', False],
            112: ['Среда', 21, 'Декабрь', 'будний', True], 113: ['Четверг', 22, 'Декабрь', 'будний', False], 114: ['Пятница', 23, 'Декабрь', 'будний', False],
            115: ['Суббота', 24, 'Декабрь', 'выходной', False], 116: ['Воскресенье', 25, 'Декабрь', 'выходной', False], 117: ['Понедельник', 26, 'Декабрь', 'будний', False],
            118: ['Вторник', 27, 'Декабрь', 'будний', False], 119: ['Среда', 28, 'Декабрь', 'будний', False], 120: ['Четверг', 29, 'Декабрь', 'будний', False],
            121: ['Пятница', 30, 'Декабрь', 'будний', False], 122: ['Суббота', 31, 'Декабрь', 'выходной', False]}


# основные показатели
define studies = 50
define finance = 50
define mental_health = 50
define physical_health = 50

# календарь
define week_day = "Четверг"
define day = 1
define month = "Сентябрь"
define day_type = "будний"

# счетчик для календаря 
define calendar_counter = 1

# счетчик для учебных вопросов
define mini_games_counter = 0

# выходной или будний 
define workday = True

# параметры для концовок
# define min_parameter
define max_parameter = 1

define good_weather = True
define weather = "хорошая"

# персонаж преподаватель
define p = Character('Препод', color="#658a65")

# правильность ответа в мини играх
define correct_answer = False

# срабатывание с.с.
define random_event = False


# выбор с.с.
define which_random_event = 0









# define calendar = {1: ['Четверг', 1, 'Сентябрь', 'будний'], 2: ['Пятница', 2, 'Сентябрь', 'будний'], 3: ['Суббота', 3, 'Сентябрь', 'выходной'],
#         4: ['Воскресенье', 4, 'Сентябрь', 'выходной'], 5: ['Понедельник', 5, 'Сентябрь', 'будний'], 6: ['Вторник', 6, 'Сентябрь', 'будний'],
#         7: ['Среда', 7, 'Сентябрь', 'будний'], 8: ['Четверг', 8, 'Сентябрь', 'будний'], 9: ['Пятница', 9, 'Сентябрь', 'будний'],
#         10: ['Суббота', 10, 'Сентябрь', 'выходной'], 11: ['Воскресенье', 11, 'Сентябрь', 'выходной'], 12: ['Понедельник', 12, 'Сентябрь', 'будний'],
#         13: ['Вторник', 13, 'Сентябрь', 'будний'], 14: ['Среда', 14, 'Сентябрь', 'будний'], 15: ['Четверг', 15, 'Сентябрь', 'будний'],
#         16: ['Пятница', 16, 'Сентябрь', 'будний'], 17: ['Суббота', 17, 'Сентябрь', 'выходной'], 18: ['Воскресенье', 18, 'Сентябрь', 'выходной'],
#         19: ['Понедельник', 19, 'Сентябрь', 'будний'], 20: ['Вторник', 20, 'Сентябрь', 'будний'], 21: ['Среда', 21, 'Сентябрь', 'будний'],
#         22: ['Четверг', 22, 'Сентябрь', 'будний'], 23: ['Пятница', 23, 'Сентябрь', 'будний'], 24: ['Суббота', 24, 'Сентябрь', 'выходной'],
#         25: ['Воскресенье', 25, 'Сентябрь', 'выходной'], 26: ['Понедельник', 26, 'Сентябрь', 'будний'], 27: ['Вторник', 27, 'Сентябрь', 'будний'],
#         28: ['Среда', 28, 'Сентябрь', 'будний'], 29: ['Четверг', 29, 'Сентябрь', 'будний'], 30: ['Пятница', 30, 'Сентябрь', 'будний'],
#         31: ['Суббота', 1, 'Октябрь', 'выходной'], 32: ['Воскресенье', 2, 'Октябрь', 'выходной'], 33: ['Понедельник', 3, 'Октябрь', 'будний'],
#         34: ['Вторник', 4, 'Октябрь', 'будний'], 35: ['Среда', 5, 'Октябрь', 'будний'], 36: ['Четверг', 6, 'Октябрь', 'будний'],
#         37: ['Пятница', 7, 'Октябрь', 'будний'], 38: ['Суббота', 8, 'Октябрь', 'выходной'], 39: ['Воскресенье', 9, 'Октябрь', 'выходной'],
#         40: ['Понедельник', 10, 'Октябрь', 'будний'], 41: ['Вторник', 11, 'Октябрь', 'будний'], 42: ['Среда', 12, 'Октябрь', 'будний'],
#         43: ['Четверг', 13, 'Октябрь', 'будний'], 44: ['Пятница', 14, 'Октябрь', 'будний'], 45: ['Суббота', 15, 'Октябрь', 'выходной'],
#         46: ['Воскресенье', 16, 'Октябрь', 'выходной'], 47: ['Понедельник', 17, 'Октябрь', 'будний'], 48: ['Вторник', 18, 'Октябрь', 'будний'],
#         49: ['Среда', 19, 'Октябрь', 'будний'], 50: ['Четверг', 20, 'Октябрь', 'будний'], 51: ['Пятница', 21, 'Октябрь', 'будний'],
#         52: ['Суббота', 22, 'Октябрь', 'выходной'], 53: ['Воскресенье', 23, 'Октябрь', 'выходной'], 54: ['Понедельник', 24, 'Октябрь', 'будний'],
#         55: ['Вторник', 25, 'Октябрь', 'будний'], 56: ['Среда', 26, 'Октябрь', 'будний'], 57: ['Четверг', 27, 'Октябрь', 'будний'],
#         58: ['Пятница', 28, 'Октябрь', 'будний'], 59: ['Суббота', 29, 'Октябрь', 'выходной'], 60: ['Воскресенье', 30, 'Октябрь', 'выходной'],
#         61: ['Понедельник', 31, 'Октябрь', 'будний'], 62: ['Вторник', 1, 'Ноябрь', 'будний'], 63: ['Среда', 2, 'Ноябрь', 'будний'],
#         64: ['Четверг', 3, 'Ноябрь', 'будний'], 65: ['Пятница', 4, 'Ноябрь', 'будний'], 66: ['Суббота', 5, 'Ноябрь', 'выходной'],
#         67: ['Воскресенье', 6, 'Ноябрь', 'выходной'], 68: ['Понедельник', 7, 'Ноябрь', 'будний'], 69: ['Вторник', 8, 'Ноябрь', 'будний'],
#         70: ['Среда', 9, 'Ноябрь', 'будний'], 71: ['Четверг', 10, 'Ноябрь', 'будний'], 72: ['Пятница', 11, 'Ноябрь', 'будний'],
#         73: ['Суббота', 12, 'Ноябрь', 'выходной'], 74: ['Воскресенье', 13, 'Ноябрь', 'выходной'], 75: ['Понедельник', 14, 'Ноябрь', 'будний'],
#         76: ['Вторник', 15, 'Ноябрь', 'будний'], 77: ['Среда', 16, 'Ноябрь', 'будний'], 78: ['Четверг', 17, 'Ноябрь', 'будний'],
#         79: ['Пятница', 18, 'Ноябрь', 'будний'], 80: ['Суббота', 19, 'Ноябрь', 'выходной'], 81: ['Воскресенье', 20, 'Ноябрь', 'выходной'],
#         82: ['Понедельник', 21, 'Ноябрь', 'будний'], 83: ['Вторник', 22, 'Ноябрь', 'будний'], 84: ['Среда', 23, 'Ноябрь', 'будний'],
#         85: ['Четверг', 24, 'Ноябрь', 'будний'], 86: ['Пятница', 25, 'Ноябрь', 'будний'], 87: ['Суббота', 26, 'Ноябрь', 'выходной'],
#         88: ['Воскресенье', 27, 'Ноябрь', 'выходной'], 89: ['Понедельник', 28, 'Ноябрь', 'будний'], 90: ['Вторник', 29, 'Ноябрь', 'будний'],
#         91: ['Среда', 30, 'Ноябрь', 'будний'], 92: ['Четверг', 1, 'Декабрь', 'будний'], 93: ['Пятница', 2, 'Декабрь', 'будний'],
#         94: ['Суббота', 3, 'Декабрь', 'выходной'], 95: ['Воскресенье', 4, 'Декабрь', 'выходной'], 96: ['Понедельник', 5, 'Декабрь', 'будний'],
#         97: ['Вторник', 6, 'Декабрь', 'будний'], 98: ['Среда', 7, 'Декабрь', 'будний'], 99: ['Четверг', 8, 'Декабрь', 'будний'],
#         100: ['Пятница', 9, 'Декабрь', 'будний'], 101: ['Суббота', 10, 'Декабрь', 'выходной'], 102: ['Воскресенье', 11, 'Декабрь', 'выходной'],
#         103: ['Понедельник', 12, 'Декабрь', 'будний'], 104: ['Вторник', 13, 'Декабрь', 'будний'], 105: ['Среда', 14, 'Декабрь', 'будний'],
#         106: ['Четверг', 15, 'Декабрь', 'будний'], 107: ['Пятница', 16, 'Декабрь', 'будний'], 108: ['Суббота', 17, 'Декабрь', 'выходной'],
#         109: ['Воскресенье', 18, 'Декабрь', 'выходной'], 110: ['Понедельник', 19, 'Декабрь', 'будний'], 111: ['Вторник', 20, 'Декабрь', 'будний'],
#         112: ['Среда', 21, 'Декабрь', 'будний'], 113: ['Четверг', 22, 'Декабрь', 'будний'], 114: ['Пятница', 23, 'Декабрь', 'будний'],
#         115: ['Суббота', 24, 'Декабрь', 'выходной'], 116: ['Воскресенье', 25, 'Декабрь', 'выходной'], 117: ['Понедельник', 26, 'Декабрь', 'будний'],
#         118: ['Вторник', 27, 'Декабрь', 'будний'], 119: ['Среда', 28, 'Декабрь', 'будний'], 120: ['Четверг', 29, 'Декабрь', 'будний'],
#         121: ['Пятница', 30, 'Декабрь', 'будний'], 122: ['Суббота', 31, 'Декабрь', 'выходной'], 123: ['Воскресенье', 1, 'Январь', 'выходной'],
#         124: ['Понедельник', 2, 'Январь', 'будний'], 125: ['Вторник', 3, 'Январь', 'будний'], 126: ['Среда', 4, 'Январь', 'будний'],
#         127: ['Четверг', 5, 'Январь', 'будний'], 128: ['Пятница', 6, 'Январь', 'будний'], 129: ['Суббота', 7, 'Январь', 'выходной'],
#         130: ['Воскресенье', 8, 'Январь', 'выходной'], 131: ['Понедельник', 9, 'Январь', 'будний'], 132: ['Вторник', 10, 'Январь', 'будний'],
#         133: ['Среда', 11, 'Январь', 'будний'], 134: ['Четверг', 12, 'Январь', 'будний'], 135: ['Пятница', 13, 'Январь', 'будний'],
#         136: ['Суббота', 14, 'Январь', 'выходной'], 137: ['Воскресенье', 15, 'Январь', 'выходной'], 138: ['Понедельник', 16, 'Январь', 'будний'],
#         139: ['Вторник', 17, 'Январь', 'будний'], 140: ['Среда', 18, 'Январь', 'будний'], 141: ['Четверг', 19, 'Январь', 'будний'],
#         142: ['Пятница', 20, 'Январь', 'будний'], 143: ['Суббота', 21, 'Январь', 'выходной'], 144: ['Воскресенье', 22, 'Январь', 'выходной'],
#         145: ['Понедельник', 23, 'Январь', 'будний'], 146: ['Вторник', 24, 'Январь', 'будний'], 147: ['Среда', 25, 'Январь', 'будний'],
#         148: ['Четверг', 26, 'Январь', 'будний'], 149: ['Пятница', 27, 'Январь', 'будний'], 150: ['Суббота', 28, 'Январь', 'выходной'],
#         151: ['Воскресенье', 29, 'Январь', 'выходной'], 152: ['Понедельник', 30, 'Январь', 'будний'], 153: ['Вторник', 31, 'Январь', 'будний']}  


