# готово нет 


label mini_game_humanitarian_1:
    p "Всем здравствуйте, сегодня у нас новая тема -  и вот вам сразу вопрос. {w}"
    "У тебя в голове всплывает несколько вариантов ответов и ты решаешь ответить на вопрос."
    menu:
        ""         
        "":
            $ correct_answer = False

        "":
            $ correct_answer = False

        "":
            $ correct_answer = True

        "":
            $ correct_answer = False

    call check_answer
        
    p '''
    s
    '''

    p "Рекомендую вам запомнить эту информацию!"
    "Хорошо, что я сходил на пары, вероятно полученные знания могут мне пригодиться в будущем! {w}Ну ладно, пора домой."

    return


label mini_game_humanitarian_2:
    p "Всем здравствуйте, сегодня у нас новая тема -  и вот вам сразу вопрос. {w}"
    "У тебя в голове всплывает несколько вариантов ответов и ты решаешь ответить на вопрос."
    menu:
        ""         
        "":
            $ correct_answer = False

        "":
            $ correct_answer = False

        "":
            $ correct_answer = True

        "":
            $ correct_answer = False

    call check_answer
        
    p '''
    s
    '''

    p "Рекомендую вам запомнить эту информацию!"
    "Хорошо, что я сходил на пары, вероятно полученные знания могут мне пригодиться в будущем! {w}Ну ладно, пора домой."

    return


label mini_game_humanitarian_3:
    p "Всем здравствуйте, сегодня у нас новая тема -  и вот вам сразу вопрос. {w}"
    "У тебя в голове всплывает несколько вариантов ответов и ты решаешь ответить на вопрос."
    menu:
        ""         
        "":
            $ correct_answer = False

        "":
            $ correct_answer = False

        "":
            $ correct_answer = True

        "":
            $ correct_answer = False

    call check_answer
        
    p '''
    s
    '''

    p "Рекомендую вам запомнить эту информацию!"
    "Хорошо, что я сходил на пары, вероятно полученные знания могут мне пригодиться в будущем! {w}Ну ладно, пора домой."

    return


label mini_game_humanitarian_4:
    p "Всем здравствуйте, сегодня у нас новая тема -  и вот вам сразу вопрос. {w}"
    "У тебя в голове всплывает несколько вариантов ответов и ты решаешь ответить на вопрос."
    menu:
        ""         
        "":
            $ correct_answer = False

        "":
            $ correct_answer = False

        "":
            $ correct_answer = True

        "":
            $ correct_answer = False

    call check_answer
        
    p '''
    s
    '''

    p "Рекомендую вам запомнить эту информацию!"
    "Хорошо, что я сходил на пары, вероятно полученные знания могут мне пригодиться в будущем! {w}Ну ладно, пора домой."

    return


label mini_game_humanitarian_5:
    p "Всем здравствуйте, сегодня у нас новая тема -  и вот вам сразу вопрос. {w}"
    "У тебя в голове всплывает несколько вариантов ответов и ты решаешь ответить на вопрос."
    menu:
        ""         
        "":
            $ correct_answer = False

        "":
            $ correct_answer = False

        "":
            $ correct_answer = True

        "":
            $ correct_answer = False

    call check_answer
        
    p '''
    s
    '''

    p "Рекомендую вам запомнить эту информацию!"
    "Хорошо, что я сходил на пары, вероятно полученные знания могут мне пригодиться в будущем! {w}Ну ладно, пора домой."

    return


label mini_game_humanitarian_6:
    p "Всем здравствуйте, сегодня у нас новая тема -  и вот вам сразу вопрос. {w}"
    "У тебя в голове всплывает несколько вариантов ответов и ты решаешь ответить на вопрос."
    menu:
        ""         
        "":
            $ correct_answer = False

        "":
            $ correct_answer = False

        "":
            $ correct_answer = True

        "":
            $ correct_answer = False

    call check_answer
        
    p '''
    s
    '''

    p "Рекомендую вам запомнить эту информацию!"
    "Хорошо, что я сходил на пары, вероятно полученные знания могут мне пригодиться в будущем! {w}Ну ладно, пора домой."

    return


label mini_game_humanitarian_7:
    p "Всем здравствуйте, сегодня у нас новая тема -  и вот вам сразу вопрос. {w}"
    "У тебя в голове всплывает несколько вариантов ответов и ты решаешь ответить на вопрос."
    menu:
        ""         
        "":
            $ correct_answer = False

        "":
            $ correct_answer = False

        "":
            $ correct_answer = True

        "":
            $ correct_answer = False

    call check_answer
        
    p '''
    s
    '''

    p "Рекомендую вам запомнить эту информацию!"
    "Хорошо, что я сходил на пары, вероятно полученные знания могут мне пригодиться в будущем! {w}Ну ладно, пора домой."

    return


label mini_game_humanitarian_8:
    p "Всем здравствуйте, сегодня у нас новая тема -  и вот вам сразу вопрос. {w}"
    "У тебя в голове всплывает несколько вариантов ответов и ты решаешь ответить на вопрос."
    menu:
        ""         
        "":
            $ correct_answer = False

        "":
            $ correct_answer = False

        "":
            $ correct_answer = True

        "":
            $ correct_answer = False

    call check_answer
        
    p '''
    s
    '''

    p "Рекомендую вам запомнить эту информацию!"
    "Хорошо, что я сходил на пары, вероятно полученные знания могут мне пригодиться в будущем! {w}Ну ладно, пора домой."

    return


label mini_game_humanitarian_9:
    p "Всем здравствуйте, сегодня у нас новая тема -  и вот вам сразу вопрос. {w}"
    "У тебя в голове всплывает несколько вариантов ответов и ты решаешь ответить на вопрос."
    menu:
        ""         
        "":
            $ correct_answer = False

        "":
            $ correct_answer = False

        "":
            $ correct_answer = True

        "":
            $ correct_answer = False

    call check_answer
        
    p '''
    s
    '''

    p "Рекомендую вам запомнить эту информацию!"
    "Хорошо, что я сходил на пары, вероятно полученные знания могут мне пригодиться в будущем! {w}Ну ладно, пора домой."

    return


label mini_game_humanitarian_10:
    p "Всем здравствуйте, сегодня у нас новая тема -  и вот вам сразу вопрос. {w}"
    "У тебя в голове всплывает несколько вариантов ответов и ты решаешь ответить на вопрос."
    menu:
        ""         
        "":
            $ correct_answer = False

        "":
            $ correct_answer = False

        "":
            $ correct_answer = True

        "":
            $ correct_answer = False

    call check_answer
        
    p '''
    s
    '''

    p "Рекомендую вам запомнить эту информацию!"
    "Хорошо, что я сходил на пары, вероятно полученные знания могут мне пригодиться в будущем! {w}Ну ладно, пора домой."

    return

