# готово
label mini_game_humanitarian_1:
    p "Всем здравствуйте, сегодня у нас новая тема - стили речи и вот вам сразу вопрос. {w}Какое определение верное?"
    "У тебя в голове всплывает несколько вариантов ответов и ты решаешь ответить на вопрос."
    menu:
        "Выберите правильное определение."         
        "Официально-деловой стиль – это стиль газет, журналов, который призван быстро откликаться на события, происходящие в обществе.":
            $ correct_answer = False

        "Научный стиль – это стиль научных статей, докладов, монографий, учебников, который определяется их содержанием и целями – по возможности точно и полно объяснить факты окружающей действительности.":
            $ correct_answer = True

        "Разговорный стиль – это стиль художественных произведений, научно-фантастических романов и рассказов, позволяющих заглянуть в будущее.":
            $ correct_answer = False

        "Публицистический стиль – это стиль общения обычного человека, позволяющий передавать эмоции и мысли другим людям.":
            $ correct_answer = False

    call check_answer from _call_check_answer
        
    p '''
    Функциональные стили речи — исторически сложившаяся система речевых средств, используемых в той или иной сфере человеческого общения; разновидность литературного языка, выполняющая определённую функцию в общении.
    
    Функциональные стили, во избежание путаницы с другими значениями слова «стиль», иногда называют языковыми жанрами, функциональными разновидностями языка. 
    
    Каждый функциональный стиль обладает своими особенностями использования общелитературной нормы, он может существовать как в письменной, так и в устной форме. 

    Традиционно выделяют пять основных разновидностей функциональных стилей речи, различающихся условиями и целями общения в какой-то сфере общественной деятельности: научный, официально-деловой, публицистический, разговорный, художественный. 
    '''

    p "Рекомендую вам запомнить эту информацию!"
    "Хорошо, что я сходил на пары, вероятно полученные знания могут мне пригодиться в будущем! {w}Ну ладно, пора домой."

    return


# готово
label mini_game_humanitarian_2:
    p "Всем здравствуйте, сегодня у нас новая тема и вот вам сразу вопрос. {w}Ошибки, связанные с отступлением от нормы в произношении — это ошибки..."
    "У тебя в голове всплывает несколько вариантов ответов и ты решаешь ответить на вопрос."
    menu:
        "Ошибки, связанные с отступлением от нормы в произношении — это ошибки..."         
        "орфографические":
            $ correct_answer = False

        "пунктуационные":
            $ correct_answer = False

        "орфоэпические":
            $ correct_answer = True

        "морфологические":
            $ correct_answer = False

    call check_answer from _call_check_answer_1
        
    p '''
    Орфоэпия — совокупность правил устной и письменной речи, закреплённых в литературном языке. Разные авторы трактуют понятие орфоэпии слегка по-разному, «широкий» подход включает нормы произношения и ударения, правильность использования речевых оборотов в речи и на письме, «узкий» подход исключает ударение из правил орфоэпии.

    Литературные нормы орфоэпии делятся на две части: правила произношения гласных и согласных звуков; правила произношения ударений. 
    
    Для орфоэпических норм характерны следующие черты: вариативность, устойчивость, общеобязательность, согласование с языковыми традициями.
    '''

    p "Рекомендую вам запомнить эту информацию!"
    "Хорошо, что я сходил на пары, вероятно полученные знания могут мне пригодиться в будущем! {w}Ну ладно, пора домой."

    return


# готово
label mini_game_humanitarian_3:
    p "Всем здравствуйте, сегодня у нас новая тема - литературные направления и вот вам сразу вопрос. {w}Направление в литературе, основанное во второй половине 18-го века. Его название происходит от французского слова «чувство»."
    "У тебя в голове всплывает несколько вариантов ответов и ты решаешь ответить на вопрос."
    menu:
        "Направление в литературе, основанное во второй половине 18-го века. Его название происходит от французского слова «чувство»."         
        "Классицизм":
            $ correct_answer = False

        "Реализм":
            $ correct_answer = False

        "Сентиментализм":
            $ correct_answer = True

        "Романтизм":
            $ correct_answer = False

    call check_answer from _call_check_answer_2
        
    p '''
    Литературное направление — совокупность литературно-эстетических и духовных принципов, характерная для произведений многих писателей, сохраняющаяся и реализующаяся в их творчестве на протяжении некоторого исторического периода. 
    
    Литературные направления складываются под влиянием исторических обстоятельств; вместе с тем иногда они имеют своих теоретиков и идеологов, в произведениях которых объясняются и обосновываются упомянутые принципы.
    
    Сентиментализм возник как протест против оторванности классицизма от жизни и отличавшееся излишней чувствительностью и идеализированным изображением людей, их переживаний, жизненной обстановки и природы.
    '''

    p "Рекомендую вам запомнить эту информацию!"
    "Хорошо, что я сходил на пары, вероятно полученные знания могут мне пригодиться в будущем! {w}Ну ладно, пора домой."

    return


# готово
label mini_game_humanitarian_4:
    p "Всем здравствуйте, сегодня у нас новая тема - история и вот вам сразу вопрос. {w}Политика руководства СССР, проводившаяся во второй половине 1980-х гг., получила название?"
    "У тебя в голове всплывает несколько вариантов ответов и ты решаешь ответить на вопрос."
    menu:
        "Политика руководства СССР, проводившаяся во второй половине 1980-х гг., получила название?"         
        "перестройка":
            $ correct_answer = True

        "оттепель":
            $ correct_answer = False

        "застой":
            $ correct_answer = False

        "дезинтеграция":
            $ correct_answer = False

    call check_answer from _call_check_answer_3
        
    p '''
    Перестройка — общее название используемое для обозначения перемен в экономической и политической структуре СССР, инициированных генеральным секретарём ЦК КПСС Михаилом Сергеевичем Горбачёвым в 1985—1991 годах. 
    
    Перестройка в конечном счёте привела к распаду СССР и превращению страны из единого государства в исторический регион в Восточной Европе, Средней и Центральной Азии, Дальнем Востоке и Сибири с 15 международно признанными и несколькими непризнанными государствами, 

    завершила и переосмыслила советскую эпоху и дала начало новой эпохе с её либеральными реформами, частной собственностью, свободным рынком, правами человека, упрощённым визовым режимом, возвратом в некоторых местах к досоветскому, традиционному строю, 
    
    пересмотру отношений со странами Востока и Запада, а также США, возрождению религиозной жизни и общин на местах и т. д.
    '''

    p "Рекомендую вам запомнить эту информацию!"
    "Хорошо, что я сходил на пары, вероятно полученные знания могут мне пригодиться в будущем! {w}Ну ладно, пора домой."

    return


# готово
label mini_game_humanitarian_5:
    p "Всем здравствуйте, сегодня у нас новая тема - философия и вот вам сразу вопрос. {w}С греческого слово “философия” переводиться как:"
    "У тебя в голове всплывает несколько вариантов ответов и ты решаешь ответить на вопрос."
    menu:
        "С греческого слово “философия” переводиться как:"         
        "Любовь к истине":
            $ correct_answer = False

        "Любовь к мудрости":
            $ correct_answer = True

        "Учение о мире":
            $ correct_answer = False

        "Божественная мудрость":
            $ correct_answer = False

    call check_answer from _call_check_answer_4
        
    p '''
    Философия — особая форма познания и система знаний об общих характеристиках, понятиях и принципах реальности, а также бытия человека, об отношении человека и окружающего его мира.
    
    К задачам философии на протяжении веков относились как изучение всеобщих законов развития мира и общества, так и изучение самого процесса познания и мышления, а также изучение нравственных категорий и ценностей. 
    
    К числу предельных философских вопросов относятся, например, вопросы: «Познаваем ли мир?», «Существует ли Бог?», «Что такое истина?», «Что такое хорошо?», «Что есть Человек?», «Что первично — материя или сознание?», «В чём смысл жизни?» и другие.
    '''
    p "Рекомендую вам запомнить эту информацию!"
    "Хорошо, что я сходил на пары, вероятно полученные знания могут мне пригодиться в будущем! {w}Ну ладно, пора домой."

    return


# готово
label mini_game_humanitarian_6:
    p "Всем здравствуйте, сегодня у нас новая тема - темперамент и вот вам сразу вопрос. {w}Медлительный, невозмутимый, терпеливый, скупой на проявление эмоций и чувств."
    "У тебя в голове всплывает несколько вариантов ответов и ты решаешь ответить на вопрос."
    menu:
        "Медлительный, невозмутимый, терпеливый, скупой на проявление эмоций и чувств."         
        "Холерик":
            $ correct_answer = False

        "Сангвиник":
            $ correct_answer = False

        "Меланхолик":
            $ correct_answer = False

        "Флегматик":
            $ correct_answer = True

    call check_answer from _call_check_answer_5
        
    p '''
    Темперамент — это совокупность устойчивых динамических особенностей психических процессов человека: темпа, ритма, интенсивности. Темперамент связан с динамическими, а не содержательными аспектами деятельности. 
    
    Темперамент определяет скорость течения психических процессов, устойчивость эмоциональной сферы, степень волевого усилия.
    
    Физиологической основой темперамента является тип высшей нервной деятельности. Темперамент составляет основу формирования и развития характера; относится к биологически-обусловленным индивидуальным различиям как человека, так и животных.
    '''

    p "Рекомендую вам запомнить эту информацию!"
    "Хорошо, что я сходил на пары, вероятно полученные знания могут мне пригодиться в будущем! {w}Ну ладно, пора домой."

    return


# готово
label mini_game_humanitarian_7:
    p "Всем здравствуйте, сегодня у нас новая тема - детерминизм и вот вам сразу вопрос. {w}Методологический подход к анализу общества, согласно которому уровень развития науки и техники определяет социальные процессы во всех сферах обществах, называется … детерминизмом."
    "У тебя в голове всплывает несколько вариантов ответов и ты решаешь ответить на вопрос."
    menu:
        "Методологический подход к анализу общества, согласно которому уровень развития науки и техники определяет социальные процессы во всех сферах обществах, называется … детерминизмом."         
        "технологическим":
            $ correct_answer = True

        "экономическим":
            $ correct_answer = False

        "психологическим":
            $ correct_answer = False

        "географическим":
            $ correct_answer = False

    call check_answer from _call_check_answer_6
        
    p '''
    Детерминизм — философская концепция о взаимосвязи и взаимной определённости всех явлений и процессов, доктрина о всеобщей причинности.

    Технологический детерминизм — это теоретико-методологическая установка в философских и социологических концепциях и исследованиях на сведение понимания общественного развития к прогрессу техники, 
    
    определяющим образом воздействующему на бытие, мышление и язык своих носителей. 
    
    Возник в 1920-х в связи с бурными успехами в развитии науки и техники, нарастающей эффективностью их массового применения в развитии производства.
    '''

    p "Рекомендую вам запомнить эту информацию!"
    "Хорошо, что я сходил на пары, вероятно полученные знания могут мне пригодиться в будущем! {w}Ну ладно, пора домой."

    return


# готово
label mini_game_humanitarian_8:
    p "Всем здравствуйте, сегодня у нас новая тема - культурология и вот вам сразу вопрос. {w}Культурология — это наука…"
    "У тебя в голове всплывает несколько вариантов ответов и ты решаешь ответить на вопрос."
    menu:
        "Культурология — это наука…"         
        "О потребностях человека":
            $ correct_answer = False

        "О социальном в человеке":
            $ correct_answer = False

        "О сущности закономерностях существования и развития человеческом значении":
            $ correct_answer = True

        "О правах и обязанностях в человеке":
            $ correct_answer = False

    call check_answer from _call_check_answer_7
        
    p '''
    Культурология — совокупность исследований культуры как структурной целостности.
    
    Предмет культурологии — исследование феномена культуры как исторически-социального опыта людей, который воплощается в специфических нормах, законах и чертах их деятельности, 
    
    передаётся из поколения в поколение в виде ценностных ориентиров и идеалов, интерпретируется в «культурных текстах» философии, религии, искусства и права.
    
    Смысл культурологии на сегодняшний день в том, чтобы учить человека на уровне культуры, как её создателя.
    '''

    p "Рекомендую вам запомнить эту информацию!"
    "Хорошо, что я сходил на пары, вероятно полученные знания могут мне пригодиться в будущем! {w}Ну ладно, пора домой."

    return


# готово
label mini_game_humanitarian_9:
    p "Всем здравствуйте, сегодня у нас новая тема - этика и вот вам сразу вопрос. {w}Над чем рассуждает этика?"
    "У тебя в голове всплывает несколько вариантов ответов и ты решаешь ответить на вопрос."
    menu:
        "Над чем рассуждает этика?"         
        "В чем заключается смысл жизни?":
            $ correct_answer = False

        "В чём заключается хорошее и что есть плохое?":
            $ correct_answer = True

        "В чём состоит предназначение человека?":
            $ correct_answer = False

        "В чём суть трагического и комического в жизни?":
            $ correct_answer = False

    call check_answer from _call_check_answer_8
        
    p '''
    Этика — философская дисциплина, исследующая нравственность и мораль. Первоначально смыслом слова этос было совместное жилище и правила, порождённые совместным проживанием, нормы, сплачивающие общество, 
    
    способствующие преодолению индивидуализма и агрессивности. 
    
    По мере развития общества к этому смыслу добавляется изучение совести, добра и зла, сочувствия, дружбы, смысла жизни, самопожертвования и так далее. 
    
    Выработанные этикой понятия — милосердие, справедливость, дружба, солидарность и другие, направляют моральное развитие социальных институтов и отношений.
    '''

    p "Рекомендую вам запомнить эту информацию!"
    "Хорошо, что я сходил на пары, вероятно полученные знания могут мне пригодиться в будущем! {w}Ну ладно, пора домой."

    return


# готово
label mini_game_humanitarian_10:
    p "Всем здравствуйте, сегодня у нас новая тема - экономика и вот вам сразу вопрос. {w}Для чего рассчитывается индекс Ласпейреса?"
    "У тебя в голове всплывает несколько вариантов ответов и ты решаешь ответить на вопрос."
    menu:
        "Для чего рассчитывается индекс Ласпейреса?"         
        "Неизменного набора товаров и услуг":
            $ correct_answer = True

        "Изменяемого набора товаров и услуг":
            $ correct_answer = False

        "Определения номинального валютного курса":
            $ correct_answer = False

        "Определения реального валютного курса":
            $ correct_answer = False

    call check_answer from _call_check_answer_9
        
    p '''
    Индексы цен и дохода представляют собой отношения средневзвешенных величин, предназначенные для измерения темпов роста общего уровня цен или темпов роста доходов соответственно.
    
    Индекс Ласпейреса определяется путём взвешивания цен двух временных периодов по объёмам потребления базисного периода и отражает изменение стоимости потребительской корзины базисного периода, произошедшее за текущий период.
    
    Индекс рассчитывается как отношение потребительских расходов, обусловленных приобретением того же набора потребительских благ по текущим ценам , к расходам на приобретение потребительской корзины базисного периода.
    '''

    p "Рекомендую вам запомнить эту информацию!"
    "Хорошо, что я сходил на пары, вероятно полученные знания могут мне пригодиться в будущем! {w}Ну ладно, пора домой."

    return

